<?php
$a = 2;
echo("<html> 
        <body>
        <h3>구구단</h3>
        <table border='1'>");

$b = 1;
while ($b <= 9) {
    $c = $a * $b;
    echo "<tr><td> $a*$b=$c</td></tr>";
    $b++;
}
echo("</table>
        </body>
        </html>");

?>

----------------------------------------------------------------------------------------------------------------------------------------------------------------

<?php
echo ("<html>
        <body>");


echo ("<h3>섭씨를 화씨로 변경</h3>
        <table border='1'>
        <tr><td>섭씨</td><td>화씨</td></tr>
        
 ");


for($c=-15;$c<=35;$c+=5){
    $f=$c*9/5 + 32;
    echo("<tr><td>$c</td><td>$f</td></tr>");
}
echo "</table>";







echo ("</body></html>");
?>
----------------------------------------------------------------------------------------------------------------------------------------------------------------
구구단 만들기

<?php
echo("<html>
        <body>");

echo("<h1>구구단 2~9단</h1>
    <table border='1'>");


echo("<tr>");
for ($a = 2; $a <= 9; $a += 1) {
    echo "<td>$a 단</td>";
}
echo("</tr>");

for ($b = 1; $b <= 9; $b += 1) {
    echo("<tr>");
    for ($c = 2; $c <= 9; $c += 1) {
        $d=$b*$c;
        echo "<td>$c*$b=$d</td>";
    }
    echo("</tr>");
}


echo "</table>";


echo("</body></html>");
?>












